IntergatedCircuits/STM32_XPD/STM32F3_XPD/src/xpd_rcc_gen.c
/** @brief Forces and releases a reset on the TIM4 peripheral. */
void XPD_TIM4_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM4RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM4RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM5EN
/** @brief Sets the new clock state of the TIM5 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM5_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM5EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_TIM5RST
/** @brief Forces and releases a reset on the TIM5 peripheral. */
void XPD_TIM5_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM5RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM5RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM6EN
/** @brief Sets the new clock state of the TIM6 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM6_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM6EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_TIM6RST
/** @brief Forces and releases a reset on the TIM6 peripheral. */
void XPD_TIM6_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM6RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM6RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_TIM7EN
/** @brief Sets the new clock state of the TIM7 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM7_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,TIM7EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_TIM7RST
/** @brief Forces and releases a reset on the TIM7 peripheral. */
void XPD_TIM7_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,TIM7RST) = 1;
    RCC_REG_BIT(APB1RSTR,TIM7RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_TIM8EN
/** @brief Sets the new clock state of the TIM8 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TIM8_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,TIM8EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2RSTR_TIM8RST
/** @brief Forces and releases a reset on the TIM8 peripheral. */
void XPD_TIM8_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,TIM8RST) = 1;
    RCC_REG_BIT(APB2RSTR,TIM8RST) = 0;
}
#endif
#ifdef RCC_AHBENR_TSCEN
/** @brief Sets the new clock state of the TSC peripheral.
 *  @param NewState: the new clock state to set */
void XPD_TSC_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(AHBENR,TSCEN) = NewState;
    NewState = (FunctionalState)RCC->AHBENR.w;
}
#endif
#ifdef RCC_AHBRSTR_TSCRST
/** @brief Forces and releases a reset on the TSC peripheral. */
void XPD_TSC_Reset(void)
{
    RCC_REG_BIT(AHBRSTR,TSCRST) = 1;
    RCC_REG_BIT(AHBRSTR,TSCRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART4EN
/** @brief Sets the new clock state of the UART4 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART4_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART4EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_UART4RST
/** @brief Forces and releases a reset on the UART4 peripheral. */
void XPD_UART4_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART4RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART4RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_UART5EN
/** @brief Sets the new clock state of the UART5 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_UART5_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,UART5EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_UART5RST
/** @brief Forces and releases a reset on the UART5 peripheral. */
void XPD_UART5_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,UART5RST) = 1;
    RCC_REG_BIT(APB1RSTR,UART5RST) = 0;
}
#endif
#ifdef RCC_APB2ENR_USART1EN
/** @brief Sets the new clock state of the USART1 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART1_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB2ENR,USART1EN) = NewState;
    NewState = (FunctionalState)RCC->APB2ENR.w;
}
#endif
#ifdef RCC_APB2RSTR_USART1RST
/** @brief Forces and releases a reset on the USART1 peripheral. */
void XPD_USART1_Reset(void)
{
    RCC_REG_BIT(APB2RSTR,USART1RST) = 1;
    RCC_REG_BIT(APB2RSTR,USART1RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_USART2EN
/** @brief Sets the new clock state of the USART2 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART2_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,USART2EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_USART2RST
/** @brief Forces and releases a reset on the USART2 peripheral. */
void XPD_USART2_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,USART2RST) = 1;
    RCC_REG_BIT(APB1RSTR,USART2RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_USART3EN
/** @brief Sets the new clock state of the USART3 peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USART3_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,USART3EN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_USART3RST
/** @brief Forces and releases a reset on the USART3 peripheral. */
void XPD_USART3_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,USART3RST) = 1;
    RCC_REG_BIT(APB1RSTR,USART3RST) = 0;
}
#endif
#ifdef RCC_APB1ENR_USBEN
/** @brief Sets the new clock state of the USB peripheral.
 *  @param NewState: the new clock state to set */
void XPD_USB_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,USBEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_USBRST
/** @brief Forces and releases a reset on the USB peripheral. */
void XPD_USB_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,USBRST) = 1;
    RCC_REG_BIT(APB1RSTR,USBRST) = 0;
}
#endif
#ifdef RCC_APB1ENR_WWDGEN
/** @brief Sets the new clock state of the WWDG peripheral.
 *  @param NewState: the new clock state to set */
void XPD_WWDG_ClockCtrl(FunctionalState NewState)
{
    RCC_REG_BIT(APB1ENR,WWDGEN) = NewState;
    NewState = (FunctionalState)RCC->APB1ENR.w;
}
#endif
#ifdef RCC_APB1RSTR_WWDGRST
/** @brief Forces and releases a reset on the WWDG peripheral. */
void XPD_WWDG_Reset(void)
{
    RCC_REG_BIT(APB1RSTR,WWDGRST) = 1;
    RCC_REG_BIT(APB1RSTR,WWDGRST) = 0;
}
#endif

/** @} */

/** @} */

/** @} */
